In [3]:
!pip install pyspark

^C

In [1]:
import pyspark

In [1]:
import pandas as pd
pd.read_csv("test.csv")

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [1]:
# starting a spark session
from pyspark.sql import SparkSession

In [2]:
spark = SparkSession.builder.master("local").appName('Practice').getOrCreate()

In [3]:
spark

In [4]:
df_pyspark = spark.read.csv('test.csv')

In [7]:
df_pyspark.show()

+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|        _c0|   _c1|                 _c2|   _c3| _c4|  _c5|  _c6|             _c7|    _c8|  _c9|    _c10|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
|        892|     3|    Kelly, Mr. James|  male|34.5|    0|    0|          330911| 7.8292| NULL|       Q|
|        893|     3|Wilkes, Mrs. Jame...|female|  47|    1|    0|          363272|      7| NULL|       S|
|        894|     2|Myles, Mr. Thomas...|  male|  62|    0|    0|          240276| 9.6875| NULL|       Q|
|        895|     3|    Wirz, Mr. Albert|  male|  27|    0|    0|          315154| 8.6625| NULL|       S|
|        896|     3|Hirvonen, Mrs. Al...|female|  22|    1|    1|         3101298|12.2875| NULL|       S|
|        897|     3|Svensson, Mr. Joh...|  male|  14|    0|    0|            7538|  9.225| NULL|       S|
|        898|     3|Connolly, Miss. Kate|female|  30|    0|    0|          330972| 7.6292| NULL|       Q|
|        899|     2|Caldwell, Mr. Alb...|  male|  26|    1|    1|          248738|     29| NULL|       S|
|        900|     3|Abrahim, Mrs. Jos...|female|  18|    0|    0|            2657| 7.2292| NULL|       C|
|        901|     3|Davies, Mr. John ...|  male|  21|    2|    0|       A/4 48871|  24.15| NULL|       S|
|        902|     3|    Ilieff, Mr. Ylio|  male|NULL|    0|    0|          349220| 7.8958| NULL|       S|
|        903|     1|Jones, Mr. Charle...|  male|  46|    0|    0|             694|     26| NULL|       S|
|        904|     1|Snyder, Mrs. John...|female|  23|    1|    0|           21228|82.2667|  B45|       S|
|        905|     2|Howard, Mr. Benjamin|  male|  63|    1|    0|           24065|     26| NULL|       S|
|        906|     1|Chaffee, Mrs. Her...|female|  47|    1|    0|     W.E.P. 5734| 61.175|  E31|       S|
|        907|     2|del Carlo, Mrs. S...|female|  24|    1|    0|   SC/PARIS 2167|27.7208| NULL|       C|
|        908|     2|   Keane, Mr. Daniel|  male|  35|    0|    0|          233734|  12.35| NULL|       Q|
|        909|     3|   Assaf, Mr. Gerios|  male|  21|    0|    0|            2692|  7.225| NULL|       C|
|        910|     3|Ilmakangas, Miss....|female|  27|    1|    0|STON/O2. 3101270|  7.925| NULL|       S|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [5]:
df_pyspark = spark.read.option('header','true').csv('test.csv', inferSchema=True)

In [13]:
df_pyspark.show()

+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|        892|     3|    Kelly, Mr. James|  male|34.5|    0|    0|          330911| 7.8292| NULL|       Q|
|        893|     3|Wilkes, Mrs. Jame...|female|47.0|    1|    0|          363272|    7.0| NULL|       S|
|        894|     2|Myles, Mr. Thomas...|  male|62.0|    0|    0|          240276| 9.6875| NULL|       Q|
|        895|     3|    Wirz, Mr. Albert|  male|27.0|    0|    0|          315154| 8.6625| NULL|       S|
|        896|     3|Hirvonen, Mrs. Al...|female|22.0|    1|    1|         3101298|12.2875| NULL|       S|
|        897|     3|Svensson, Mr. Joh...|  male|14.0|    0|    0|            7538|  9.225| NULL|       S|
|        898|     3|Connolly, Miss. Kate|female|30.0|    0|    0|          330972| 7.6292| NULL|       Q|
|        899|     2|Caldwell, Mr. Alb...|  male|26.0|    1|    1|          248738|   29.0| NULL|       S|
|        900|     3|Abrahim, Mrs. Jos...|female|18.0|    0|    0|            2657| 7.2292| NULL|       C|
|        901|     3|Davies, Mr. John ...|  male|21.0|    2|    0|       A/4 48871|  24.15| NULL|       S|
|        902|     3|    Ilieff, Mr. Ylio|  male|NULL|    0|    0|          349220| 7.8958| NULL|       S|
|        903|     1|Jones, Mr. Charle...|  male|46.0|    0|    0|             694|   26.0| NULL|       S|
|        904|     1|Snyder, Mrs. John...|female|23.0|    1|    0|           21228|82.2667|  B45|       S|
|        905|     2|Howard, Mr. Benjamin|  male|63.0|    1|    0|           24065|   26.0| NULL|       S|
|        906|     1|Chaffee, Mrs. Her...|female|47.0|    1|    0|     W.E.P. 5734| 61.175|  E31|       S|
|        907|     2|del Carlo, Mrs. S...|female|24.0|    1|    0|   SC/PARIS 2167|27.7208| NULL|       C|
|        908|     2|   Keane, Mr. Daniel|  male|35.0|    0|    0|          233734|  12.35| NULL|       Q|
|        909|     3|   Assaf, Mr. Gerios|  male|21.0|    0|    0|            2692|  7.225| NULL|       C|
|        910|     3|Ilmakangas, Miss....|female|27.0|    1|    0|STON/O2. 3101270|  7.925| NULL|       S|
|        911|     3|"Assaf Khalil, Mr...|female|45.0|    0|    0|            2696|  7.225| NULL|       C|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [15]:
type(df_pyspark)

pyspark.sql.dataframe.DataFrame

In [12]:
df_pyspark.head(3)

[Row(PassengerId='892', Pclass='3', Name='Kelly, Mr. James', Sex='male', Age='34.5', SibSp='0', Parch='0', Ticket='330911', Fare='7.8292', Cabin=None, Embarked='Q'),
 Row(PassengerId='893', Pclass='3', Name='Wilkes, Mrs. James (Ellen Needs)', Sex='female', Age='47', SibSp='1', Parch='0', Ticket='363272', Fare='7', Cabin=None, Embarked='S'),
 Row(PassengerId='894', Pclass='2', Name='Myles, Mr. Thomas Francis', Sex='male', Age='62', SibSp='0', Parch='0', Ticket='240276', Fare='9.6875', Cabin=None, Embarked='Q')]

In [16]:
df_pyspark.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [17]:
df_pyspark.columns

['PassengerId',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [18]:
df_pyspark.select('Pclass')

DataFrame[Pclass: int]

In [19]:
df_pyspark.select('Pclass').show()

+------+
|Pclass|
+------+
|     3|
|     3|
|     2|
|     3|
|     3|
|     3|
|     3|
|     2|
|     3|
|     3|
|     3|
|     1|
|     1|
|     2|
|     1|
|     2|
|     2|
|     3|
|     3|
|     3|
+------+
only showing top 20 rows

In [21]:
df_pyspark.select(['Pclass', 'SibSp']).show()

+------+-----+
|Pclass|SibSp|
+------+-----+
|     3|    0|
|     3|    1|
|     2|    0|
|     3|    0|
|     3|    1|
|     3|    0|
|     3|    0|
|     2|    1|
|     3|    0|
|     3|    2|
|     3|    0|
|     1|    0|
|     1|    1|
|     2|    1|
|     1|    1|
|     2|    1|
|     2|    0|
|     3|    0|
|     3|    1|
|     3|    0|
+------+-----+
only showing top 20 rows

In [22]:
df_pyspark.dtypes

[('PassengerId', 'int'),
 ('Pclass', 'int'),
 ('Name', 'string'),
 ('Sex', 'string'),
 ('Age', 'double'),
 ('SibSp', 'int'),
 ('Parch', 'int'),
 ('Ticket', 'string'),
 ('Fare', 'double'),
 ('Cabin', 'string'),
 ('Embarked', 'string')]

In [23]:
df_pyspark.describe()

DataFrame[summary: string, PassengerId: string, Pclass: string, Name: string, Sex: string, Age: string, SibSp: string, Parch: string, Ticket: string, Fare: string, Cabin: string, Embarked: string]

In [24]:
df_pyspark.describe().show()

+-------+------------------+------------------+--------------------+------+------------------+------------------+------------------+------------------+------------------+-----+--------+
|summary|       PassengerId|            Pclass|                Name|   Sex|               Age|             SibSp|             Parch|            Ticket|              Fare|Cabin|Embarked|
+-------+------------------+------------------+--------------------+------+------------------+------------------+------------------+------------------+------------------+-----+--------+
|  count|               418|               418|                 418|   418|               332|               418|               418|               418|               417|   91|     418|
|   mean|            1100.5|2.2655502392344498|                NULL|  NULL|30.272590361445783|0.4473684210526316|0.3923444976076555|223850.98986486485|  35.6271884892086| NULL|    NULL|
| stddev|120.81045760473994|0.8418375519640503|                NULL|  NULL|14.181209235624424|0.8967595611217135|0.9814288785371694| 369523.7764694362|55.907576179973844| NULL|    NULL|
|    min|               892|                 1|"Assaf Khalil, Mr...|female|              0.17|                 0|                 0|            110469|               0.0|  A11|       C|
|    max|              1309|                 3|van Billiard, Mas...|  male|              76.0|                 8|                 9|       W.E.P. 5734|          512.3292|   G6|       S|
+-------+------------------+------------------+--------------------+------+------------------+------------------+------------------+------------------+------------------+-----+--------+

In [28]:
# adding columns
df_pyspark = df_pyspark.withColumn('Parch 2 years', df_pyspark['Parch']+2)

In [29]:
df_pyspark.show()

+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+-------------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|Parch 2 years|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+-------------+
|        892|     3|    Kelly, Mr. James|  male|34.5|    0|    0|          330911| 7.8292| NULL|       Q|            2|
|        893|     3|Wilkes, Mrs. Jame...|female|47.0|    1|    0|          363272|    7.0| NULL|       S|            2|
|        894|     2|Myles, Mr. Thomas...|  male|62.0|    0|    0|          240276| 9.6875| NULL|       Q|            2|
|        895|     3|    Wirz, Mr. Albert|  male|27.0|    0|    0|          315154| 8.6625| NULL|       S|            2|
|        896|     3|Hirvonen, Mrs. Al...|female|22.0|    1|    1|         3101298|12.2875| NULL|       S|            3|
|        897|     3|Svensson, Mr. Joh...|  male|14.0|    0|    0|            7538|  9.225| NULL|       S|            2|
|        898|     3|Connolly, Miss. Kate|female|30.0|    0|    0|          330972| 7.6292| NULL|       Q|            2|
|        899|     2|Caldwell, Mr. Alb...|  male|26.0|    1|    1|          248738|   29.0| NULL|       S|            3|
|        900|     3|Abrahim, Mrs. Jos...|female|18.0|    0|    0|            2657| 7.2292| NULL|       C|            2|
|        901|     3|Davies, Mr. John ...|  male|21.0|    2|    0|       A/4 48871|  24.15| NULL|       S|            2|
|        902|     3|    Ilieff, Mr. Ylio|  male|NULL|    0|    0|          349220| 7.8958| NULL|       S|            2|
|        903|     1|Jones, Mr. Charle...|  male|46.0|    0|    0|             694|   26.0| NULL|       S|            2|
|        904|     1|Snyder, Mrs. John...|female|23.0|    1|    0|           21228|82.2667|  B45|       S|            2|
|        905|     2|Howard, Mr. Benjamin|  male|63.0|    1|    0|           24065|   26.0| NULL|       S|            2|
|        906|     1|Chaffee, Mrs. Her...|female|47.0|    1|    0|     W.E.P. 5734| 61.175|  E31|       S|            2|
|        907|     2|del Carlo, Mrs. S...|female|24.0|    1|    0|   SC/PARIS 2167|27.7208| NULL|       C|            2|
|        908|     2|   Keane, Mr. Daniel|  male|35.0|    0|    0|          233734|  12.35| NULL|       Q|            2|
|        909|     3|   Assaf, Mr. Gerios|  male|21.0|    0|    0|            2692|  7.225| NULL|       C|            2|
|        910|     3|Ilmakangas, Miss....|female|27.0|    1|    0|STON/O2. 3101270|  7.925| NULL|       S|            2|
|        911|     3|"Assaf Khalil, Mr...|female|45.0|    0|    0|            2696|  7.225| NULL|       C|            2|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+-------------+
only showing top 20 rows

In [30]:
# dropping the column
df_pyspark = df_pyspark.drop("Parch 2 years")

In [31]:
df_pyspark.show()

+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|        892|     3|    Kelly, Mr. James|  male|34.5|    0|    0|          330911| 7.8292| NULL|       Q|
|        893|     3|Wilkes, Mrs. Jame...|female|47.0|    1|    0|          363272|    7.0| NULL|       S|
|        894|     2|Myles, Mr. Thomas...|  male|62.0|    0|    0|          240276| 9.6875| NULL|       Q|
|        895|     3|    Wirz, Mr. Albert|  male|27.0|    0|    0|          315154| 8.6625| NULL|       S|
|        896|     3|Hirvonen, Mrs. Al...|female|22.0|    1|    1|         3101298|12.2875| NULL|       S|
|        897|     3|Svensson, Mr. Joh...|  male|14.0|    0|    0|            7538|  9.225| NULL|       S|
|        898|     3|Connolly, Miss. Kate|female|30.0|    0|    0|          330972| 7.6292| NULL|       Q|
|        899|     2|Caldwell, Mr. Alb...|  male|26.0|    1|    1|          248738|   29.0| NULL|       S|
|        900|     3|Abrahim, Mrs. Jos...|female|18.0|    0|    0|            2657| 7.2292| NULL|       C|
|        901|     3|Davies, Mr. John ...|  male|21.0|    2|    0|       A/4 48871|  24.15| NULL|       S|
|        902|     3|    Ilieff, Mr. Ylio|  male|NULL|    0|    0|          349220| 7.8958| NULL|       S|
|        903|     1|Jones, Mr. Charle...|  male|46.0|    0|    0|             694|   26.0| NULL|       S|
|        904|     1|Snyder, Mrs. John...|female|23.0|    1|    0|           21228|82.2667|  B45|       S|
|        905|     2|Howard, Mr. Benjamin|  male|63.0|    1|    0|           24065|   26.0| NULL|       S|
|        906|     1|Chaffee, Mrs. Her...|female|47.0|    1|    0|     W.E.P. 5734| 61.175|  E31|       S|
|        907|     2|del Carlo, Mrs. S...|female|24.0|    1|    0|   SC/PARIS 2167|27.7208| NULL|       C|
|        908|     2|   Keane, Mr. Daniel|  male|35.0|    0|    0|          233734|  12.35| NULL|       Q|
|        909|     3|   Assaf, Mr. Gerios|  male|21.0|    0|    0|            2692|  7.225| NULL|       C|
|        910|     3|Ilmakangas, Miss....|female|27.0|    1|    0|STON/O2. 3101270|  7.925| NULL|       S|
|        911|     3|"Assaf Khalil, Mr...|female|45.0|    0|    0|            2696|  7.225| NULL|       C|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [33]:
# rename the column
df_pyspark.withColumnRenamed('PassengerId', 'p_id').show()

+----+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|p_id|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+----+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
| 892|     3|    Kelly, Mr. James|  male|34.5|    0|    0|          330911| 7.8292| NULL|       Q|
| 893|     3|Wilkes, Mrs. Jame...|female|47.0|    1|    0|          363272|    7.0| NULL|       S|
| 894|     2|Myles, Mr. Thomas...|  male|62.0|    0|    0|          240276| 9.6875| NULL|       Q|
| 895|     3|    Wirz, Mr. Albert|  male|27.0|    0|    0|          315154| 8.6625| NULL|       S|
| 896|     3|Hirvonen, Mrs. Al...|female|22.0|    1|    1|         3101298|12.2875| NULL|       S|
| 897|     3|Svensson, Mr. Joh...|  male|14.0|    0|    0|            7538|  9.225| NULL|       S|
| 898|     3|Connolly, Miss. Kate|female|30.0|    0|    0|          330972| 7.6292| NULL|       Q|
| 899|     2|Caldwell, Mr. Alb...|  male|26.0|    1|    1|          248738|   29.0| NULL|       S|
| 900|     3|Abrahim, Mrs. Jos...|female|18.0|    0|    0|            2657| 7.2292| NULL|       C|
| 901|     3|Davies, Mr. John ...|  male|21.0|    2|    0|       A/4 48871|  24.15| NULL|       S|
| 902|     3|    Ilieff, Mr. Ylio|  male|NULL|    0|    0|          349220| 7.8958| NULL|       S|
| 903|     1|Jones, Mr. Charle...|  male|46.0|    0|    0|             694|   26.0| NULL|       S|
| 904|     1|Snyder, Mrs. John...|female|23.0|    1|    0|           21228|82.2667|  B45|       S|
| 905|     2|Howard, Mr. Benjamin|  male|63.0|    1|    0|           24065|   26.0| NULL|       S|
| 906|     1|Chaffee, Mrs. Her...|female|47.0|    1|    0|     W.E.P. 5734| 61.175|  E31|       S|
| 907|     2|del Carlo, Mrs. S...|female|24.0|    1|    0|   SC/PARIS 2167|27.7208| NULL|       C|
| 908|     2|   Keane, Mr. Daniel|  male|35.0|    0|    0|          233734|  12.35| NULL|       Q|
| 909|     3|   Assaf, Mr. Gerios|  male|21.0|    0|    0|            2692|  7.225| NULL|       C|
| 910|     3|Ilmakangas, Miss....|female|27.0|    1|    0|STON/O2. 3101270|  7.925| NULL|       S|
| 911|     3|"Assaf Khalil, Mr...|female|45.0|    0|    0|            2696|  7.225| NULL|       C|
+----+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [34]:
# handelling Missing values

In [4]:
# handelling null values
df_pyspark.na.drop().show()

+-----------+------+--------------------+------+----+-----+-----+-----------+-------+---------------+--------+
|        _c0|   _c1|                 _c2|   _c3| _c4|  _c5|  _c6|        _c7|    _c8|            _c9|    _c10|
+-----------+------+--------------------+------+----+-----+-----+-----------+-------+---------------+--------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|     Ticket|   Fare|          Cabin|Embarked|
|        904|     1|Snyder, Mrs. John...|female|  23|    1|    0|      21228|82.2667|            B45|       S|
|        906|     1|Chaffee, Mrs. Her...|female|  47|    1|    0|W.E.P. 5734| 61.175|            E31|       S|
|        916|     1|Ryerson, Mrs. Art...|female|  48|    1|    3|   PC 17608|262.375|B57 B59 B63 B66|       C|
|        918|     1|Ostby, Miss. Hele...|female|  22|    0|    1|     113509|61.9792|            B36|       C|
|        920|     1|Brady, Mr. John B...|  male|  41|    0|    0|     113054|   30.5|            A21|       S|
|        926|     1|Mock, Mr. Philipp...|  male|  30|    1|    0|      13236|  57.75|            C78|       C|
|        936|     1|Kimball, Mrs. Edw...|female|  45|    1|    0|      11753|52.5542|            D19|       S|
|        938|     1|Chevre, Mr. Paul ...|  male|  45|    0|    0|   PC 17594|   29.7|             A9|       C|
|        940|     1|Bucknell, Mrs. Wi...|female|  60|    0|    0|      11813|76.2917|            D15|       C|
|        942|     1|Smith, Mr. Lucien...|  male|  24|    1|    0|      13695|     60|            C31|       S|
|        945|     1|Fortune, Miss. Et...|female|  28|    3|    2|      19950|    263|    C23 C25 C27|       S|
|        949|     3|Abelseth, Mr. Ola...|  male|  25|    0|    0|     348122|   7.65|          F G63|       S|
|        951|     1|Chaudanson, Miss....|female|  36|    0|    0|   PC 17608|262.375|            B61|       C|
|        956|     1|Ryerson, Master. ...|  male|  13|    2|    2|   PC 17608|262.375|B57 B59 B63 B66|       C|
|        960|     1|Tucker, Mr. Gilbe...|  male|  31|    0|    0|       2543|28.5375|            C53|       C|
|        961|     1|Fortune, Mrs. Mar...|female|  60|    1|    4|      19950|    263|    C23 C25 C27|       S|
|        965|     1|Ovies y Rodriguez...|  male|28.5|    0|    0|   PC 17562|27.7208|            D43|       C|
|        966|     1|Geiger, Miss. Amalie|female|  35|    0|    0|     113503|  211.5|           C130|       C|
|        967|     1|  Keeping, Mr. Edwin|  male|32.5|    0|    0|     113503|  211.5|           C132|       C|
+-----------+------+--------------------+------+----+-----+-----+-----------+-------+---------------+--------+
only showing top 20 rows

In [5]:
df_pyspark.na.drop(how = "any").show()

+-----------+------+--------------------+------+----+-----+-----+-----------+-------+---------------+--------+
|        _c0|   _c1|                 _c2|   _c3| _c4|  _c5|  _c6|        _c7|    _c8|            _c9|    _c10|
+-----------+------+--------------------+------+----+-----+-----+-----------+-------+---------------+--------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|     Ticket|   Fare|          Cabin|Embarked|
|        904|     1|Snyder, Mrs. John...|female|  23|    1|    0|      21228|82.2667|            B45|       S|
|        906|     1|Chaffee, Mrs. Her...|female|  47|    1|    0|W.E.P. 5734| 61.175|            E31|       S|
|        916|     1|Ryerson, Mrs. Art...|female|  48|    1|    3|   PC 17608|262.375|B57 B59 B63 B66|       C|
|        918|     1|Ostby, Miss. Hele...|female|  22|    0|    1|     113509|61.9792|            B36|       C|
|        920|     1|Brady, Mr. John B...|  male|  41|    0|    0|     113054|   30.5|            A21|       S|
|        926|     1|Mock, Mr. Philipp...|  male|  30|    1|    0|      13236|  57.75|            C78|       C|
|        936|     1|Kimball, Mrs. Edw...|female|  45|    1|    0|      11753|52.5542|            D19|       S|
|        938|     1|Chevre, Mr. Paul ...|  male|  45|    0|    0|   PC 17594|   29.7|             A9|       C|
|        940|     1|Bucknell, Mrs. Wi...|female|  60|    0|    0|      11813|76.2917|            D15|       C|
|        942|     1|Smith, Mr. Lucien...|  male|  24|    1|    0|      13695|     60|            C31|       S|
|        945|     1|Fortune, Miss. Et...|female|  28|    3|    2|      19950|    263|    C23 C25 C27|       S|
|        949|     3|Abelseth, Mr. Ola...|  male|  25|    0|    0|     348122|   7.65|          F G63|       S|
|        951|     1|Chaudanson, Miss....|female|  36|    0|    0|   PC 17608|262.375|            B61|       C|
|        956|     1|Ryerson, Master. ...|  male|  13|    2|    2|   PC 17608|262.375|B57 B59 B63 B66|       C|
|        960|     1|Tucker, Mr. Gilbe...|  male|  31|    0|    0|       2543|28.5375|            C53|       C|
|        961|     1|Fortune, Mrs. Mar...|female|  60|    1|    4|      19950|    263|    C23 C25 C27|       S|
|        965|     1|Ovies y Rodriguez...|  male|28.5|    0|    0|   PC 17562|27.7208|            D43|       C|
|        966|     1|Geiger, Miss. Amalie|female|  35|    0|    0|     113503|  211.5|           C130|       C|
|        967|     1|  Keeping, Mr. Edwin|  male|32.5|    0|    0|     113503|  211.5|           C132|       C|
+-----------+------+--------------------+------+----+-----+-----+-----------+-------+---------------+--------+
only showing top 20 rows

In [6]:
# threshold
df_pyspark.na.drop(how = "any", thresh = 2).show()

+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|        _c0|   _c1|                 _c2|   _c3| _c4|  _c5|  _c6|             _c7|    _c8|  _c9|    _c10|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
|        892|     3|    Kelly, Mr. James|  male|34.5|    0|    0|          330911| 7.8292| NULL|       Q|
|        893|     3|Wilkes, Mrs. Jame...|female|  47|    1|    0|          363272|      7| NULL|       S|
|        894|     2|Myles, Mr. Thomas...|  male|  62|    0|    0|          240276| 9.6875| NULL|       Q|
|        895|     3|    Wirz, Mr. Albert|  male|  27|    0|    0|          315154| 8.6625| NULL|       S|
|        896|     3|Hirvonen, Mrs. Al...|female|  22|    1|    1|         3101298|12.2875| NULL|       S|
|        897|     3|Svensson, Mr. Joh...|  male|  14|    0|    0|            7538|  9.225| NULL|       S|
|        898|     3|Connolly, Miss. Kate|female|  30|    0|    0|          330972| 7.6292| NULL|       Q|
|        899|     2|Caldwell, Mr. Alb...|  male|  26|    1|    1|          248738|     29| NULL|       S|
|        900|     3|Abrahim, Mrs. Jos...|female|  18|    0|    0|            2657| 7.2292| NULL|       C|
|        901|     3|Davies, Mr. John ...|  male|  21|    2|    0|       A/4 48871|  24.15| NULL|       S|
|        902|     3|    Ilieff, Mr. Ylio|  male|NULL|    0|    0|          349220| 7.8958| NULL|       S|
|        903|     1|Jones, Mr. Charle...|  male|  46|    0|    0|             694|     26| NULL|       S|
|        904|     1|Snyder, Mrs. John...|female|  23|    1|    0|           21228|82.2667|  B45|       S|
|        905|     2|Howard, Mr. Benjamin|  male|  63|    1|    0|           24065|     26| NULL|       S|
|        906|     1|Chaffee, Mrs. Her...|female|  47|    1|    0|     W.E.P. 5734| 61.175|  E31|       S|
|        907|     2|del Carlo, Mrs. S...|female|  24|    1|    0|   SC/PARIS 2167|27.7208| NULL|       C|
|        908|     2|   Keane, Mr. Daniel|  male|  35|    0|    0|          233734|  12.35| NULL|       Q|
|        909|     3|   Assaf, Mr. Gerios|  male|  21|    0|    0|            2692|  7.225| NULL|       C|
|        910|     3|Ilmakangas, Miss....|female|  27|    1|    0|STON/O2. 3101270|  7.925| NULL|       S|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [7]:
# subset
df_pyspark.na.drop(how = "any", subset=['SibSp']).show()

AnalysisException: [UNRESOLVED_COLUMN.WITH_SUGGESTION] A column or function parameter with name `SibSp` cannot be resolved. Did you mean one of the following? [`_c0`, `_c1`, `_c2`, `_c3`, `_c4`, `_c5`, `_c6`, `_c7`, `_c8`, `_c9`, `_c10`].

In [8]:
# filling the missing value
df_pyspark.na.fill('Missing Values').show()

+-----------+------+--------------------+------+--------------+-----+-----+----------------+-------+--------------+--------+
|        _c0|   _c1|                 _c2|   _c3|           _c4|  _c5|  _c6|             _c7|    _c8|           _c9|    _c10|
+-----------+------+--------------------+------+--------------+-----+-----+----------------+-------+--------------+--------+
|PassengerId|Pclass|                Name|   Sex|           Age|SibSp|Parch|          Ticket|   Fare|         Cabin|Embarked|
|        892|     3|    Kelly, Mr. James|  male|          34.5|    0|    0|          330911| 7.8292|Missing Values|       Q|
|        893|     3|Wilkes, Mrs. Jame...|female|            47|    1|    0|          363272|      7|Missing Values|       S|
|        894|     2|Myles, Mr. Thomas...|  male|            62|    0|    0|          240276| 9.6875|Missing Values|       Q|
|        895|     3|    Wirz, Mr. Albert|  male|            27|    0|    0|          315154| 8.6625|Missing Values|       S|
|        896|     3|Hirvonen, Mrs. Al...|female|            22|    1|    1|         3101298|12.2875|Missing Values|       S|
|        897|     3|Svensson, Mr. Joh...|  male|            14|    0|    0|            7538|  9.225|Missing Values|       S|
|        898|     3|Connolly, Miss. Kate|female|            30|    0|    0|          330972| 7.6292|Missing Values|       Q|
|        899|     2|Caldwell, Mr. Alb...|  male|            26|    1|    1|          248738|     29|Missing Values|       S|
|        900|     3|Abrahim, Mrs. Jos...|female|            18|    0|    0|            2657| 7.2292|Missing Values|       C|
|        901|     3|Davies, Mr. John ...|  male|            21|    2|    0|       A/4 48871|  24.15|Missing Values|       S|
|        902|     3|    Ilieff, Mr. Ylio|  male|Missing Values|    0|    0|          349220| 7.8958|Missing Values|       S|
|        903|     1|Jones, Mr. Charle...|  male|            46|    0|    0|             694|     26|Missing Values|       S|
|        904|     1|Snyder, Mrs. John...|female|            23|    1|    0|           21228|82.2667|           B45|       S|
|        905|     2|Howard, Mr. Benjamin|  male|            63|    1|    0|           24065|     26|Missing Values|       S|
|        906|     1|Chaffee, Mrs. Her...|female|            47|    1|    0|     W.E.P. 5734| 61.175|           E31|       S|
|        907|     2|del Carlo, Mrs. S...|female|            24|    1|    0|   SC/PARIS 2167|27.7208|Missing Values|       C|
|        908|     2|   Keane, Mr. Daniel|  male|            35|    0|    0|          233734|  12.35|Missing Values|       Q|
|        909|     3|   Assaf, Mr. Gerios|  male|            21|    0|    0|            2692|  7.225|Missing Values|       C|
|        910|     3|Ilmakangas, Miss....|female|            27|    1|    0|STON/O2. 3101270|  7.925|Missing Values|       S|
+-----------+------+--------------------+------+--------------+-----+-----+----------------+-------+--------------+--------+
only showing top 20 rows

In [14]:
# replacing null values
from pyspark.ml.feature import Imputer
imputer = Imputer(
    inputCols=['SibSp', 'Parch'],
    outputCols=["{}_imputed".format(c) for c in ['SibSp', 'Parch']]
).setStrategy("mean")

In [15]:
imputer.fit(df_pyspark).transform(df_pyspark).show()

+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+-------------+-------------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|SibSp_imputed|Parch_imputed|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+-------------+-------------+
|        892|     3|    Kelly, Mr. James|  male|34.5|    0|    0|          330911| 7.8292| NULL|       Q|            0|            0|
|        893|     3|Wilkes, Mrs. Jame...|female|47.0|    1|    0|          363272|    7.0| NULL|       S|            1|            0|
|        894|     2|Myles, Mr. Thomas...|  male|62.0|    0|    0|          240276| 9.6875| NULL|       Q|            0|            0|
|        895|     3|    Wirz, Mr. Albert|  male|27.0|    0|    0|          315154| 8.6625| NULL|       S|            0|            0|
|        896|     3|Hirvonen, Mrs. Al...|female|22.0|    1|    1|         3101298|12.2875| NULL|       S|            1|            1|
|        897|     3|Svensson, Mr. Joh...|  male|14.0|    0|    0|            7538|  9.225| NULL|       S|            0|            0|
|        898|     3|Connolly, Miss. Kate|female|30.0|    0|    0|          330972| 7.6292| NULL|       Q|            0|            0|
|        899|     2|Caldwell, Mr. Alb...|  male|26.0|    1|    1|          248738|   29.0| NULL|       S|            1|            1|
|        900|     3|Abrahim, Mrs. Jos...|female|18.0|    0|    0|            2657| 7.2292| NULL|       C|            0|            0|
|        901|     3|Davies, Mr. John ...|  male|21.0|    2|    0|       A/4 48871|  24.15| NULL|       S|            2|            0|
|        902|     3|    Ilieff, Mr. Ylio|  male|NULL|    0|    0|          349220| 7.8958| NULL|       S|            0|            0|
|        903|     1|Jones, Mr. Charle...|  male|46.0|    0|    0|             694|   26.0| NULL|       S|            0|            0|
|        904|     1|Snyder, Mrs. John...|female|23.0|    1|    0|           21228|82.2667|  B45|       S|            1|            0|
|        905|     2|Howard, Mr. Benjamin|  male|63.0|    1|    0|           24065|   26.0| NULL|       S|            1|            0|
|        906|     1|Chaffee, Mrs. Her...|female|47.0|    1|    0|     W.E.P. 5734| 61.175|  E31|       S|            1|            0|
|        907|     2|del Carlo, Mrs. S...|female|24.0|    1|    0|   SC/PARIS 2167|27.7208| NULL|       C|            1|            0|
|        908|     2|   Keane, Mr. Daniel|  male|35.0|    0|    0|          233734|  12.35| NULL|       Q|            0|            0|
|        909|     3|   Assaf, Mr. Gerios|  male|21.0|    0|    0|            2692|  7.225| NULL|       C|            0|            0|
|        910|     3|Ilmakangas, Miss....|female|27.0|    1|    0|STON/O2. 3101270|  7.925| NULL|       S|            1|            0|
|        911|     3|"Assaf Khalil, Mr...|female|45.0|    0|    0|            2696|  7.225| NULL|       C|            0|            0|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+-------------+-------------+
only showing top 20 rows

In [16]:
# filter operations

In [18]:
df_pyspark.filter("Fare>8.6625").show()

+-----------+------+--------------------+------+----+-----+-----+-------------+-------+---------------+--------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|       Ticket|   Fare|          Cabin|Embarked|
+-----------+------+--------------------+------+----+-----+-----+-------------+-------+---------------+--------+
|        894|     2|Myles, Mr. Thomas...|  male|62.0|    0|    0|       240276| 9.6875|           NULL|       Q|
|        896|     3|Hirvonen, Mrs. Al...|female|22.0|    1|    1|      3101298|12.2875|           NULL|       S|
|        897|     3|Svensson, Mr. Joh...|  male|14.0|    0|    0|         7538|  9.225|           NULL|       S|
|        899|     2|Caldwell, Mr. Alb...|  male|26.0|    1|    1|       248738|   29.0|           NULL|       S|
|        901|     3|Davies, Mr. John ...|  male|21.0|    2|    0|    A/4 48871|  24.15|           NULL|       S|
|        903|     1|Jones, Mr. Charle...|  male|46.0|    0|    0|          694|   26.0|           NULL|       S|
|        904|     1|Snyder, Mrs. John...|female|23.0|    1|    0|        21228|82.2667|            B45|       S|
|        905|     2|Howard, Mr. Benjamin|  male|63.0|    1|    0|        24065|   26.0|           NULL|       S|
|        906|     1|Chaffee, Mrs. Her...|female|47.0|    1|    0|  W.E.P. 5734| 61.175|            E31|       S|
|        907|     2|del Carlo, Mrs. S...|female|24.0|    1|    0|SC/PARIS 2167|27.7208|           NULL|       C|
|        908|     2|   Keane, Mr. Daniel|  male|35.0|    0|    0|       233734|  12.35|           NULL|       Q|
|        912|     1|Rothschild, Mr. M...|  male|55.0|    1|    0|     PC 17603|   59.4|           NULL|       C|
|        914|     1|Flegenheim, Mrs. ...|female|NULL|    0|    0|     PC 17598|31.6833|           NULL|       S|
|        915|     1|Williams, Mr. Ric...|  male|21.0|    0|    1|     PC 17597|61.3792|           NULL|       C|
|        916|     1|Ryerson, Mrs. Art...|female|48.0|    1|    3|     PC 17608|262.375|B57 B59 B63 B66|       C|
|        917|     3|Robins, Mr. Alexa...|  male|50.0|    1|    0|    A/5. 3337|   14.5|           NULL|       S|
|        918|     1|Ostby, Miss. Hele...|female|22.0|    0|    1|       113509|61.9792|            B36|       C|
|        920|     1|Brady, Mr. John B...|  male|41.0|    0|    0|       113054|   30.5|            A21|       S|
|        921|     3|   Samaan, Mr. Elias|  male|NULL|    2|    0|         2662|21.6792|           NULL|       C|
|        922|     2|Louch, Mr. Charle...|  male|50.0|    1|    0|   SC/AH 3085|   26.0|           NULL|       S|
+-----------+------+--------------------+------+----+-----+-----+-------------+-------+---------------+--------+
only showing top 20 rows

In [20]:
df_pyspark.filter((df_pyspark['Fare']>8.6625) & (df_pyspark['SibSp']>0)).show()

+-----------+------+--------------------+------+----+-----+-----+-------------+-------+---------------+--------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|       Ticket|   Fare|          Cabin|Embarked|
+-----------+------+--------------------+------+----+-----+-----+-------------+-------+---------------+--------+
|        896|     3|Hirvonen, Mrs. Al...|female|22.0|    1|    1|      3101298|12.2875|           NULL|       S|
|        899|     2|Caldwell, Mr. Alb...|  male|26.0|    1|    1|       248738|   29.0|           NULL|       S|
|        901|     3|Davies, Mr. John ...|  male|21.0|    2|    0|    A/4 48871|  24.15|           NULL|       S|
|        904|     1|Snyder, Mrs. John...|female|23.0|    1|    0|        21228|82.2667|            B45|       S|
|        905|     2|Howard, Mr. Benjamin|  male|63.0|    1|    0|        24065|   26.0|           NULL|       S|
|        906|     1|Chaffee, Mrs. Her...|female|47.0|    1|    0|  W.E.P. 5734| 61.175|            E31|       S|
|        907|     2|del Carlo, Mrs. S...|female|24.0|    1|    0|SC/PARIS 2167|27.7208|           NULL|       C|
|        912|     1|Rothschild, Mr. M...|  male|55.0|    1|    0|     PC 17603|   59.4|           NULL|       C|
|        916|     1|Ryerson, Mrs. Art...|female|48.0|    1|    3|     PC 17608|262.375|B57 B59 B63 B66|       C|
|        917|     3|Robins, Mr. Alexa...|  male|50.0|    1|    0|    A/5. 3337|   14.5|           NULL|       S|
|        921|     3|   Samaan, Mr. Elias|  male|NULL|    2|    0|         2662|21.6792|           NULL|       C|
|        922|     2|Louch, Mr. Charle...|  male|50.0|    1|    0|   SC/AH 3085|   26.0|           NULL|       S|
|        923|     2|Jefferys, Mr. Cli...|  male|24.0|    2|    0|   C.A. 31029|   31.5|           NULL|       S|
|        924|     3|Dean, Mrs. Bertra...|female|33.0|    1|    2|    C.A. 2315| 20.575|           NULL|       S|
|        925|     3|"Johnston, Mrs. A...|female|NULL|    1|    2|   W./C. 6607|  23.45|           NULL|       S|
|        926|     1|Mock, Mr. Philipp...|  male|30.0|    1|    0|        13236|  57.75|            C78|       C|
|        936|     1|Kimball, Mrs. Edw...|female|45.0|    1|    0|        11753|52.5542|            D19|       S|
|        942|     1|Smith, Mr. Lucien...|  male|24.0|    1|    0|        13695|   60.0|            C31|       S|
|        944|     2|Hocking, Miss. El...|female|20.0|    2|    1|        29105|   23.0|           NULL|       S|
|        945|     1|Fortune, Miss. Et...|female|28.0|    3|    2|        19950|  263.0|    C23 C25 C27|       S|
+-----------+------+--------------------+------+----+-----+-----+-------------+-------+---------------+--------+
only showing top 20 rows

In [6]:
# inverse operation
df_pyspark.filter(~(df_pyspark['Fare']>8.6625)).show()

+-----------+------+--------------------+------+----+-----+-----+------------------+------+-----+--------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|            Ticket|  Fare|Cabin|Embarked|
+-----------+------+--------------------+------+----+-----+-----+------------------+------+-----+--------+
|        892|     3|    Kelly, Mr. James|  male|34.5|    0|    0|            330911|7.8292| NULL|       Q|
|        893|     3|Wilkes, Mrs. Jame...|female|47.0|    1|    0|            363272|   7.0| NULL|       S|
|        895|     3|    Wirz, Mr. Albert|  male|27.0|    0|    0|            315154|8.6625| NULL|       S|
|        898|     3|Connolly, Miss. Kate|female|30.0|    0|    0|            330972|7.6292| NULL|       Q|
|        900|     3|Abrahim, Mrs. Jos...|female|18.0|    0|    0|              2657|7.2292| NULL|       C|
|        902|     3|    Ilieff, Mr. Ylio|  male|NULL|    0|    0|            349220|7.8958| NULL|       S|
|        909|     3|   Assaf, Mr. Gerios|  male|21.0|    0|    0|              2692| 7.225| NULL|       C|
|        910|     3|Ilmakangas, Miss....|female|27.0|    1|    0|  STON/O2. 3101270| 7.925| NULL|       S|
|        911|     3|"Assaf Khalil, Mr...|female|45.0|    0|    0|              2696| 7.225| NULL|       C|
|        913|     3|Olsen, Master. Ar...|  male| 9.0|    0|    1|           C 17368|3.1708| NULL|       S|
|        919|     3|   Daher, Mr. Shedid|  male|22.5|    0|    0|              2698| 7.225| NULL|       C|
|        927|     3|"Katavelas, Mr. V...|  male|18.5|    0|    0|              2682|7.2292| NULL|       C|
|        928|     3| Roth, Miss. Sarah A|female|NULL|    0|    0|            342712|  8.05| NULL|       S|
|        929|     3|  Cacic, Miss. Manda|female|21.0|    0|    0|            315087|8.6625| NULL|       S|
|        934|     3|Goldsmith, Mr. Na...|  male|41.0|    0|    0|SOTON/O.Q. 3101263|  7.85| NULL|       S|
|        937|     3|Peltomaki, Mr. Ni...|  male|25.0|    0|    0| STON/O 2. 3101291| 7.925| NULL|       S|
|        939|     3|Shaughnessy, Mr. ...|  male|NULL|    0|    0|            370374|  7.75| NULL|       Q|
|        948|     3|     Cor, Mr. Bartol|  male|35.0|    0|    0|            349230|7.8958| NULL|       S|
|        949|     3|Abelseth, Mr. Ola...|  male|25.0|    0|    0|            348122|  7.65|F G63|       S|
|        952|     3|     Dika, Mr. Mirko|  male|17.0|    0|    0|            349232|7.8958| NULL|       S|
+-----------+------+--------------------+------+----+-----+-----+------------------+------+-----+--------+
only showing top 20 rows

In [9]:
# groupby and aggrigate function
df_pyspark.groupBy('Name').sum().show()

+--------------------+----------------+-----------+--------+----------+----------+---------+
|                Name|sum(PassengerId)|sum(Pclass)|sum(Age)|sum(SibSp)|sum(Parch)|sum(Fare)|
+--------------------+----------------+-----------+--------+----------+----------+---------+
|Rosblom, Miss. Sa...|            1176|          3|     2.0|         1|         1|  20.2125|
|  Lithman, Mr. Simon|            1062|          3|    NULL|         0|         0|     7.55|
|Collett, Mr. Sidn...|            1099|          2|    24.0|         0|         0|     10.5|
|Abrahamsson, Mr. ...|            1143|          3|    20.0|         0|         0|    7.925|
|Bjorklund, Mr. Er...|             954|          3|    18.0|         0|         0|     7.75|
|Hocking, Miss. El...|             944|          2|    20.0|         2|         1|     23.0|
|Ovies y Rodriguez...|             965|          1|    28.5|         0|         0|  27.7208|
|Hansen, Mrs. Clau...|            1201|          3|    45.0|         1|         0|  14.1083|
|Maguire, Mr. John...|            1227|          1|    30.0|         0|         0|     26.0|
|Bucknell, Mrs. Wi...|             940|          1|    60.0|         0|         0|  76.2917|
|Cook, Mrs. (Selen...|            1114|          2|    22.0|         0|         0|     10.5|
|Ostby, Miss. Hele...|             918|          1|    22.0|         0|         1|  61.9792|
|"Moubarek, Mrs. G...|            1117|          3|    NULL|         0|         2|  15.2458|
|Gilbert, Mr. William|            1285|          2|    47.0|         0|         0|     10.5|
|Geiger, Miss. Amalie|             966|          1|    35.0|         0|         0|    211.5|
|    Miles, Mr. Frank|             968|          3|    NULL|         0|         0|     8.05|
|Straus, Mrs. Isid...|            1006|          1|    63.0|         1|         0| 221.7792|
|Aldworth, Mr. Cha...|             970|          2|    30.0|         0|         0|     13.0|
|Bryhl, Miss. Dagm...|            1167|          2|    20.0|         1|         0|     26.0|
|Phillips, Miss. A...|            1078|          2|    21.0|         0|         1|     21.0|
+--------------------+----------------+-----------+--------+----------+----------+---------+
only showing top 20 rows

In [10]:
# using test 3 data set

In [12]:
df_pyspark = spark.read.csv('test3.csv')
df_pyspark.show()

+---------+------------+------+
|      _c0|         _c1|   _c2|
+---------+------------+------+
|     Name| Departments|salary|
|    Krish|Data Science| 10000|
|    Krish|         IOT|  5000|
|   Mahesh|    Big Data|  4000|
|    Krish|    Big Data|  4000|
|   Mahesh|Data Science|  3000|
|Sudhanshu|Data Science| 20000|
|Sudhanshu|         IOT| 10000|
|Sudhanshu|    Big Data|  5000|
|    Sunny|Data Science| 10000|
|    Sunny|    Big Data|  2000|
+---------+------------+------+

In [14]:
df_pyspark = spark.read.option('header','true').csv('test3.csv', inferSchema=True)
df_pyspark.show()

+---------+------------+------+
|     Name| Departments|salary|
+---------+------------+------+
|    Krish|Data Science| 10000|
|    Krish|         IOT|  5000|
|   Mahesh|    Big Data|  4000|
|    Krish|    Big Data|  4000|
|   Mahesh|Data Science|  3000|
|Sudhanshu|Data Science| 20000|
|Sudhanshu|         IOT| 10000|
|Sudhanshu|    Big Data|  5000|
|    Sunny|Data Science| 10000|
|    Sunny|    Big Data|  2000|
+---------+------------+------+

In [15]:
df_pyspark.groupBy('Name').sum().show()

+---------+-----------+
|     Name|sum(salary)|
+---------+-----------+
|Sudhanshu|      35000|
|    Sunny|      12000|
|    Krish|      19000|
|   Mahesh|       7000|
+---------+-----------+

In [16]:
# Groupby departments which gives maximum salary
df_pyspark.groupBy('Departments').sum().show()

+------------+-----------+
| Departments|sum(salary)|
+------------+-----------+
|         IOT|      15000|
|    Big Data|      15000|
|Data Science|      43000|
+------------+-----------+

In [17]:
df_pyspark.groupBy('Departments').mean().show()

+------------+-----------+
| Departments|avg(salary)|
+------------+-----------+
|         IOT|     7500.0|
|    Big Data|     3750.0|
|Data Science|    10750.0|
+------------+-----------+

In [18]:
df_pyspark.groupBy('Departments').count().show()

+------------+-----+
| Departments|count|
+------------+-----+
|         IOT|    2|
|    Big Data|    4|
|Data Science|    4|
+------------+-----+

In [19]:
df_pyspark.agg({'Salary':'sum'}).show()

+-----------+
|sum(Salary)|
+-----------+
|      73000|
+-----------+

In [20]:
df_pyspark.groupBy('Name').max().show()

+---------+-----------+
|     Name|max(salary)|
+---------+-----------+
|Sudhanshu|      20000|
|    Sunny|      10000|
|    Krish|      10000|
|   Mahesh|       4000|
+---------+-----------+